bot_greeting = 'Добро пожаловать в бот.\n\n' \
               'Первым делом нужно указать желаемую вакансию (можно несколько через ' \
               'запятую). Стоп-слова используются для уточнения того, что искать не надо. ' \
               'Их тоже может быть несколько.' \
               '\n\n' \
               'Приятного использования. :3'

user_entry_created = 'Ваша база данных успешно создана. Приятного использования.'

enter_job_names = 'Введите названия желаемых должностей через запятую:'

enter_stop_words = 'В поиске также могут использоваться стоп-слова - то, что НЕ должно ' \
                   'присутствовать в названиях вакансий. Чтобы указать их, нажмите сюда: ' \
                   '/add_stop_words.'

only_text_warning = 'Бот приемлет только текст. Попробуйте ещё раз.'

job_list_acquired = 'Список должностей успешно сохранён.'

stop_words_acquired = 'Список стоп-слов успешно сохранён.'

bot_error_message = 'Что-то пошло не так. Пожалуйста, попробуйте ещё раз.'

set_job_names_first = 'Ваша база данных пока пуста. Для начала нужно добавить должности для ' \
                      'поиска. Для этого нажмите сюда: /add_job_names'

job_name_changed = 'Название должности изменено.'
