bot_greeting = 'Добро пожаловать в бот.\n\n' \
               'Первым делом нужно указать желаемую вакансию (можно несколько через ' \
               'запятую). Стоп-слова используются для уточнения того, что искать не надо. ' \
               'Их тоже может быть несколько.' \
               '\n\n' \
               'Приятного использования. :3'

user_entry_created = 'Ваша база данных успешно создана. Приятного использования.'

enter_jobs = 'Введите названия желаемых должностей через запятую:'

enter_stops = 'Стоп-слова - это то, что НЕ должно присутствовать в названиях вакансий. ' \
                   'Например, если вы хотите видеть вакансии по Python, но при этом вам не нужны ' \
                   'вакансии по Java. Чтобы указать их, введите их через запятую:'

only_text_warning = 'Бот приемлет только текст. Попробуйте ещё раз.'

jobs_list_acquired = 'Список должностей успешно сохранён.'

stops_acquired = 'Список стоп-слов успешно сохранён.'

bot_error_message = 'Что-то пошло не так. Пожалуйста, попробуйте ещё раз.'

set_jobs_first = 'Ваша база данных пока пуста. Для начала нужно добавить должности для ' \
                      'поиска. Для этого нажмите сюда: /add_job_names'

job_name_changed = 'Название должности изменено.'

connection_closed = 'Connection to the database closed.'

edit_message = '\n\nК сожалению, Telegram не позволяет ботам самостоятельно заполнять ' \
                      'поле ввода, поэтому чтобы отредактировать, придётся скопировать ' \
                      'и заново вставить:'

table_cleanup_message = 'Данные успешно удалены. База данных очищена.'
