add_jobs = 'Введите названия желаемых должностей через запятую:'

add_stops = 'Стоп-слова - это то, что НЕ должно присутствовать в названиях вакансий. ' \
            'Например, если вы хотите видеть вакансии по Python, но при этом вам не нужны ' \
            'вакансии по Java. Чтобы указать их, введите их через запятую:'

bot_error_message = 'Что-то пошло не так. Пожалуйста, попробуйте ещё раз.'

bot_greeting = 'Добро пожаловать в бот.\n\n' \
               'Этот бот предназначен для того, чтобы регулярно просматривать www.hh.ru ' \
               'на предмет новых вакансий по вашим критериям, и присылать их вам.\n\n' \
               'В первую очередь нужно указать желаемую вакансию (можно несколько через ' \
               'запятую). Также можно указать стоп-слова - они используются для уточнения ' \
               'того, что искать не надо. Например, если вам нужны вакансии разработчика ' \
               'Python, а вакансии JavaScript и PHP разработчика, наоборот, не нужны. ' \
               'Их тоже может быть несколько.' \
               '\n\n' \
               'Чтобы указать вакансии - нажмите /add_jobs.\n\n' \
               'Чтобы указать стоп-слова - нажмите /add_stops.\n\n' \
               'Приятного использования. :3'

changing_data = 'Изменяем следующие данные:\n\n'

connection_closed = 'Connection to the database closed.'

deleting_data = 'Удаляем следующие данные:\n\n'

edit_message = '\n\nК сожалению, Telegram не позволяет ботам самостоятельно заполнять ' \
               'поле ввода, поэтому нажмите на текст, чтобы скопировать его, ' \
               'и вставьте в поле ввода, где вы сможете его изменить:'

job_name_changed = 'Название должности изменено.'

jobs_acquired = 'Список должностей успешно сохранён.'

no_new_vacancies = 'Новых вакансий нет.'

only_text_warning = 'В этом состоянии бот приемлет только текст, и не примелет ' \
                    'команды или что-либо другое. Попробуйте ещё раз.'

parsing_message = 'Парсим hh.ru. На это потребуется минута или две. Пожалуйста, ожидайте.'

set_jobs_first = 'Ваша база данных пока пуста. Для начала нужно добавить должности для ' \
                 'поиска. Для этого нажмите сюда: /add_jobs'

stops_acquired = 'Список стоп-слов успешно сохранён.'

stops_empty = 'Список ваших стоп-слов на настоящий момент пуст. Чтобы добавить их, нажмите ' \
              'сюда: /add_stops'

table_cleanup_message = 'Данные успешно удалены. База данных очищена.'

too_many_vacancies_1 = 'По вашему поиску найдено'

too_many_vacancies_2 = 'вакансий. Обработка такого большого количества займёт слишком много ' \
                       'времени. Рекомендуем вам добавить стоп-слова или указать более ' \
                       'специфичные названия вакансий.'

user_deleted = 'Ваша учётная запись и все ваши данные удалены.'

user_entry_created = 'Ваша база данных успешно создана. Приятного использования.'

user_not_exist = 'Ваша учётная запись не обнаружена. Возможно, вы уже удалили её раньше.'
